astb_relise/src/DataProcessors/ЗагрузкаИзображенийНоменклатурыВостокСервис/ЗагрузкаИзображенийНоменклатурыВостокСервис.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаИзображенийНоменклатурыВостокСервис</name>
  <attributes>
    <name>FTPСоединениеАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FTPСоединениеПароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FTPСоединениеПассивноеСоединение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>FTPСоединениеПользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FTPСоединениеПорт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FTPСоединениеПуть</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>HTTPСоединениеАдресСервераЗагрузки</name>
    <comment>№142456 </comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>HTTPСоединениеАдресСервераЧтения</name>
    <comment>№142456 </comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТаблицаДляЗагрузки</name>
    <attributes>
      <name>Использовать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Артикул</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Изображение</name>
      <type>
        <types>CatalogRef.НоменклатураПрисоединенныеФайлы</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаЗагрузки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНаFTP</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресИзображения</name>
      <comment>№142456 </comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

astb_relise/src/InformationRegisters/НастройкиПодключенияFTPДляДополнительныхОбработок/НастройкиПодключенияFTPДляДополнительныхОбработок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиПодключенияFTPДляДополнительныхОбработок</name>
  <resources>
    <name>НастройкиПодключенияFTP</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <dimensions>
    <name>ИдентификаторОбъекта</name>
    <type>
      <types>String</types>
      <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

astb_relise/src/DataProcessors/ЗагрузкаИзображенийНоменклатурыВостокСервис/Forms/Форма/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ВосстановитьНастройкиПодключенияFTPНаСервере();
	
	Если НЕ ЗначениеЗаполнено(Объект.FTPСоединениеАдрес) Тогда
		
		//Трегубов А.А. -- №142456  --  10.11.2021 <<<
		//Объект.FTPСоединениеАдрес 				= "188.120.246.193";
		//Объект.FTPСоединениеПассивноеСоединение = Истина;
		//Объект.FTPСоединениеПароль 				= "AjnnW9";
		//Объект.FTPСоединениеПользователь 		= "web192_user";
		//Объект.FTPСоединениеПорт 				= 21;
		//Объект.FTPСоединениеПуть 				= "web/small";
		
		Объект.FTPСоединениеАдрес 				  = "web10.vostok.ru";
		Объект.FTPСоединениеПассивноеСоединение   = Истина;
		Объект.FTPСоединениеПароль 				  = "3Y3x1Z7t";
		Объект.FTPСоединениеПользователь 		  = "web199_user";
		Объект.FTPСоединениеПорт 				  = 21;
		Объект.FTPСоединениеПуть 			  	  = "shop";
		Объект.HTTPСоединениеАдресСервераЗагрузки = "http://cdn.vostok.ru";
		Объект.HTTPСоединениеАдресСервераЧтения   = "https://static.vostok.ru"; 
		//Трегубов А.А. -- №142456  --  10.11.2021 >>>		
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьFTPКаталогПоУмолчанию(Команда)
	
	//Объект.FTPСоединениеПуть = "web/small";
	Объект.FTPСоединениеПуть = "";
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПодключениеFTP(Команда)
	
	ПроверитьПодключениеFTPНаСервере();
		
КонецПроцедуры

&НаСервере
Процедура ПроверитьПодключениеFTPНаСервере()
	
	ПараметрыЗагрузки = Новый Структура(
		"FTPСоединениеАдрес, FTPСоединениеПароль, FTPСоединениеПассивноеСоединение, FTPСоединениеПользователь, FTPСоединениеПорт, FTPСоединениеПуть",
		Объект.FTPСоединениеАдрес, Объект.FTPСоединениеПароль, Объект.FTPСоединениеПассивноеСоединение, Объект.FTPСоединениеПользователь, Объект.FTPСоединениеПорт, Объект.FTPСоединениеПуть);
		
	ЗаполнитьЗначенияСвойств(ПараметрыЗагрузки, ЭтаФорма);
	
	Если Обработки.ЗагрузкаИзображенийНоменклатурыВостокСервис.УстановитьFTPСоединение(ПараметрыЗагрузки) = Неопределено Тогда
		Сообщить("Ошибка подключения к FTP!");
	Иначе
		Сообщить("Подключение к FTP выполнено успешно.");
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройкиПодключенияFTP(Команда)
	
	СохранитьНастройкиПодключенияFTPНаСервере();
		
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиПодключенияFTPНаСервере() 
	
	ИдентификаторОбработки = ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Обработка.ЗагрузкаИзображенийНоменклатурыВостокСервис");
		
	Если ЗначениеЗаполнено(ИдентификаторОбработки) Тогда
		
		СтруктураНастроек = Новый Структура;
		СтруктураНастроек.Вставить("FTPСоединениеАдрес",				Объект.FTPСоединениеАдрес);
		СтруктураНастроек.Вставить("FTPСоединениеПароль",				Объект.FTPСоединениеПароль);
		СтруктураНастроек.Вставить("FTPСоединениеПассивноеСоединение",	Объект.FTPСоединениеПассивноеСоединение);
		СтруктураНастроек.Вставить("FTPСоединениеПользователь",			Объект.FTPСоединениеПользователь);
		СтруктураНастроек.Вставить("FTPСоединениеПорт",					Объект.FTPСоединениеПорт);
		СтруктураНастроек.Вставить("FTPСоединениеПуть",					Объект.FTPСоединениеПуть);
		
		//Трегубов А.А. -- №142456 --  10.11.2021 <<<
		СтруктураНастроек.Вставить("HTTPСоединениеАдресСервераЗагрузки",Объект.HTTPСоединениеАдресСервераЗагрузки);
		СтруктураНастроек.Вставить("HTTPСоединениеАдресСервераЧтения",	Объект.HTTPСоединениеАдресСервераЧтения);
		//Трегубов А.А. -- №142456 --  10.11.2021 >>>
		
		НаборЗаписей = РегистрыСведений.НастройкиПодключенияFTPДляДополнительныхОбработок.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ИдентификаторОбъекта.Установить(ИдентификаторОбработки);
		НаборЗаписей.Прочитать();
		
		Если НаборЗаписей.Количество() = 0 Тогда
			НоваяЗапись 						= НаборЗаписей.Добавить();
			НоваяЗапись.ИдентификаторОбъекта 	= ИдентификаторОбработки;
			НоваяЗапись.НастройкиПодключенияFTP	= Новый ХранилищеЗначения(СтруктураНастроек);
		Иначе
			НаборЗаписей[0].ИдентификаторОбъекта	= ИдентификаторОбработки;
			НаборЗаписей[0].НастройкиПодключенияFTP	= Новый ХранилищеЗначения(СтруктураНастроек);
		КонецЕсли;
		
		НаборЗаписей.Записать();
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ВосстановитьНастройкиПодключенияFTPНаСервере()
	
	ИдентификаторОбработки = ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Обработка.ЗагрузкаИзображенийНоменклатурыВостокСервис");
	
	Если ЗначениеЗаполнено(ИдентификаторОбработки) Тогда
		
		НаборЗаписей = РегистрыСведений.НастройкиПодключенияFTPДляДополнительныхОбработок.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ИдентификаторОбъекта.Установить(ИдентификаторОбработки);
		НаборЗаписей.Прочитать();
		
		Если НЕ НаборЗаписей.Количество() = 0 Тогда
			СтруктураНастроек 						= НаборЗаписей[0].НастройкиПодключенияFTP.Получить();
			Объект.FTPСоединениеАдрес 				= СтруктураНастроек.FTPСоединениеАдрес;
			Объект.FTPСоединениеПароль 				= СтруктураНастроек.FTPСоединениеПароль;
			Объект.FTPСоединениеПассивноеСоединение = СтруктураНастроек.FTPСоединениеПассивноеСоединение;
			Объект.FTPСоединениеПользователь 		= СтруктураНастроек.FTPСоединениеПользователь;
			Объект.FTPСоединениеПорт 				= СтруктураНастроек.FTPСоединениеПорт;
			Объект.FTPСоединениеПуть 				= СтруктураНастроек.FTPСоединениеПуть;
			
			//Трегубов А.А. -- №142456 --  10.11.2021 <<<
			Объект.HTTPСоединениеАдресСервераЗагрузки  = СтруктураНастроек.HTTPСоединениеАдресСервераЗагрузки;
			Объект.HTTPСоединениеАдресСервераЧтения    = СтруктураНастроек.HTTPСоединениеАдресСервераЧтения;
			//Трегубов А.А. -- №142456 --  10.11.2021 >>>
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НайтиИзображения(Команда)
	
	ЗаполнитьТаблицуНаСервере();
	
	Элементы.ТаблицаДляЗагрузки.КоманднаяПанель.ПодчиненныеЭлементы.ТаблицаДляЗагрузкиЗагрузитьИзображения.Видимость = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуНаСервере()
	
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");	
	
	Обработки.ЗагрузкаИзображенийНоменклатурыВостокСервис.ЗаполнитьТаблицуДляЗагрузки(ТекущийОбъект);
	
	ЗначениеВРеквизитФормы(ТекущийОбъект,"Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзображения(Команда)
	
	ЗагрузитьИзображенияНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьИзображенияНаСервере()
	
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");	
	
	Обработки.ЗагрузкаИзображенийНоменклатурыВостокСервис.ВыполнитьЗагрузку(ТекущийОбъект,ЭтаФорма.УникальныйИдентификатор);
	
	ЗначениеВРеквизитФормы(ТекущийОбъект,"Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьНовые(Команда)
	
	Для Каждого СтрокаТаблицы Из Объект.ТаблицаДляЗагрузки Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Изображение) Тогда
			СтрокаТаблицы.Использовать = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьИзмененные(Команда)
	
	Для Каждого СтрокаТаблицы Из Объект.ТаблицаДляЗагрузки Цикл
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.Изображение) И (СтрокаТаблицы.ДатаЗагрузки < СтрокаТаблицы.ДатаНаFTP) Тогда
			СтрокаТаблицы.Использовать = Истина;
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	
	Для Каждого СтрокаТаблицы Из Объект.ТаблицаДляЗагрузки Цикл
		
		СтрокаТаблицы.Использовать = Истина;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьПометки(Команда)
	
	Для Каждого СтрокаТаблицы Из Объект.ТаблицаДляЗагрузки Цикл
		
		СтрокаТаблицы.Использовать = Ложь;
		
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ИнвертироватьПометки(Команда)
	
	Для Каждого СтрокаТаблицы Из Объект.ТаблицаДляЗагрузки Цикл
		
		СтрокаТаблицы.Использовать = НЕ СтрокаТаблицы.Использовать;
		
	КонецЦикла;
	
КонецПроцедуры
